grevaillot/svd_tools/headers/STM32F7x7/otg_fs_host.h
/** @defgroup otg_fs_host_otg_fs_hctsiz0 OTGFSHCTSIZ0 OTG_FS host channel-0 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ0_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ0_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz0_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ0_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ0_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ0_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar1 OTGFSHCCHAR1 OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1)
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR1_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR1_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR1_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR1_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR1_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar1_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR1_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR1_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar1_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR1_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR1_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR1_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR1_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR1_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR1_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar1_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR1_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR1_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint1 OTGFSHCINT1 OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT1_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT1_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT1_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT1_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT1_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT1_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT1_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT1_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT1_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT1_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT1_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT1_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT1_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT1_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT1_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT1_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT1_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk1 OTGFSHCINTMSK1 OTG_FS host channel-1 mask register (OTG_FS_HCINTMSK1)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK1_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz1 OTGFSHCTSIZ1 OTG_FS host channel-1 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ1_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ1_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz1_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ1_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ1_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar2 OTGFSHCCHAR2 OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR2_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR2_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR2_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR2_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR2_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR2_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR2_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR2_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar2_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR2_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR2_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar2_mcnt MCNT Multicount
@{*/
/**@}*/


