grevaillot/svd_tools/headers/STM32F7x7/otg_fs_host.h
#define OTG_FS_HOST_OTG_FS_HCCHAR8_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR8_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar8_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR8_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR8_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar8_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint8 OTGFSHCINT8 OTG_FS host channel-8 interrupt register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT8_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT8_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT8_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT8_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT8_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT8_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT8_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT8_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT8_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT8_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT8_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT8_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT8_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT8_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT8_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT8_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT8_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT8_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk8 OTGFSHCINTMSK8 OTG_FS host channel-8 mask register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK8_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_TXERRM Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz8 OTGFSHCTSIZ8 OTG_FS host channel-8 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ8_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ8_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz8_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ8_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ8_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz8_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ8_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ8_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz8_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar9 OTGFSHCCHAR9 OTG_FS host channel-9 characteristics register
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR9_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR9_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR9_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR9_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR9_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar9_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR9_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR9_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar9_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR9_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR9_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar9_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR9_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR9_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR9_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR9_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar9_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR9_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR9_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar9_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint9 OTGFSHCINT9 OTG_FS host channel-9 interrupt register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT9_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT9_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT9_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT9_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT9_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT9_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT9_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT9_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT9_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT9_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT9_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT9_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT9_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT9_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT9_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT9_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT9_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT9_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk9 OTGFSHCINTMSK9 OTG_FS host channel-9 mask register
@{*/

