grevaillot/svd_tools/headers/STM32F7x7/otg_fs_host.h
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz9 OTGFSHCTSIZ9 OTG_FS host channel-9 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ9_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ9_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz9_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ9_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ9_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz9_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ9_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ9_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz9_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar10 OTGFSHCCHAR10 OTG_FS host channel-10 characteristics register
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR10_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR10_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR10_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR10_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR10_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar10_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR10_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR10_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar10_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR10_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR10_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar10_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR10_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR10_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR10_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR10_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar10_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR10_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR10_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar10_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint10 OTGFSHCINT10 OTG_FS host channel-10 interrupt register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT10_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT10_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT10_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT10_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT10_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT10_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT10_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT10_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT10_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT10_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT10_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT10_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT10_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT10_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT10_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT10_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT10_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT10_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk10 OTGFSHCINTMSK10 OTG_FS host channel-10 mask register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK10_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz10 OTGFSHCTSIZ10 OTG_FS host channel-10 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ10_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ10_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz10_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ10_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ10_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz10_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ10_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ10_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz10_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar11 OTGFSHCCHAR11 OTG_FS host channel-11 characteristics register
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR11_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR11_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR11_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11_ODDFRM		(1 << 29)

