grevaillot/svd_tools/headers/STM32F7x7/otg_fs_host.h
#define OTG_FS_HOST_OTG_FS_HCCHAR11_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR11_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar11_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR11_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR11_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar11_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR11_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR11_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar11_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR11_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR11_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR11_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR11_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar11_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR11_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR11_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar11_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint11 OTGFSHCINT11 OTG_FS host channel-11 interrupt register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT11_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT11_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT11_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT11_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT11_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT11_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT11_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT11_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT11_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT11_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT11_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT11_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT11_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT11_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT11_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT11_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT11_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT11_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk11 OTGFSHCINTMSK11 OTG_FS host channel-11 mask register
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK11_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz11 OTGFSHCTSIZ11 OTG_FS host channel-11 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ11_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ11_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz11_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ11_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ11_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz11_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ11_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ11_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz11_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
